load-tests/local.yaml
config:
  target: http://localhost:3000
  phases:
    - name: Standard
      duration: 30
      arrivalCount: 1
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - post:
          url: '/counter'
          json:
            userId: '{{$uuid}}'
            value: 1
          capture:
            json: '$.id'
            as: 'counterId'
      - think: 1
      - loop:
          - patch:
              url: '/counter/{{counterId}}'
              json:
                value: "{{ $loopElement }}"
        over:
          - 2
          - 3
          - 4
          - 5
          - 6
          - 7
          - 8
      - think: 1
      - get:
          url: '/counter/{{counterId}}'