load-tests/main.yaml
config:
  target: https://scottdb.net/api
  phases:
    - name: Standard
      duration: 30
      arrivalCount: 30
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - post:
          url: '/counter'
          json:
            userId: '{{$uuid}}'
            value: 1
          capture:
            json: '$.id'
            as: 'counterId'
      - think: 1
      - get:
          url: '/counter/{{counterId}}'